In [2]:
#IMPORT Libraries
import pandas as pd
import numpy as np
import os

In [3]:
path= r'/Users/mdiaz/Desktop/CF/Project 4 Instacart Python/Data/Org/4.3_orders_products'

In [4]:
df_prods = pd.read_csv(os.path.join(path, 'products.csv'), index_col = False)

In [15]:
df_ords = pd.read_csv(os.path.join(path, '/Users/mdiaz/Desktop/CF/Project 4 Instacart Python/Data/Org/Prepared Data 4.4/orders_wrangled.csv'), index_col = False)

In [16]:
# EXERCISE - CREATING MIXED DF

In [17]:
df_test = pd.DataFrame()

In [18]:
df_test['mix'] = ['a', 'b', 1, True]

In [19]:
df_test

    mix
0     a
1     b
2     1
3  True

In [20]:
# EXERCISE - CHECK FOR MIXED DATA TYPES

In [21]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [22]:
# EXERCISE - FINDING MISSING VALUES

In [23]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [24]:
df_nam = df_prods[df_prods['product_name'].isnull() == True]

In [25]:
# Creat new df 
df_nam

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [26]:
# EXERCISE - ADDRESSING MISSING VALUES

In [28]:
#Compare # of rows w/ new subset
df_prods.shape

(49693, 5)

In [29]:
# Final command
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [30]:
# Check if # has decreased
df_prods_clean.shape

(49677, 5)

In [31]:
# EXERCISE - FINDING DUPLICATES

In [32]:
# Look for full duplicates within your DF
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [33]:
# Display the duplicate rows
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [34]:
# EXCERCISE - ADDRESSING DUPLICATES

In [35]:
df_prods_clean.shape

(49677, 5)

In [36]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [37]:
df_prods_clean_no_dups.shape

(49672, 5)

In [38]:
# EXERCISE - Renaming for clarity

In [41]:
df_prods_clean_no_dups = df_prods_clean

TASK 4.5

In [43]:
#1 - Consistency Check (above)

In [44]:
# 2 - Describe
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

The min all have the same values across the columns, but the max value isn't quite summing with the 50%

In [47]:
# 3 - Check for mixed-type data 

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [48]:
# 4 - If you find mixed-type data, fix it

No mixed data was found (weird > 0 )

In [49]:
#5 - Run a check for missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [52]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [53]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [54]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

There is a high number of "days_since_prior_order" missing - This may occur for the following reasons: 
1. This field may not have been entered during the data entry process 
2. Perhaps this field was added recently, so it doesn't have much history 
3. These are new customers and therefore do not have previous orders

In [55]:
# 6 - Address the missing values using an appropriate method
df_ords_clean = df_ords

In [56]:
df_ords_clean['new_customer'] = df_ords['days_since_prior_order'].isnull() == True

In [57]:
df_ords_clean.head()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False

In [59]:
#7 - Run a check for duplicate values
df_ords_clean[df_ords.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_since_prior_order, new_customer]
Index: []

There are no duplicates in the dataframe

In [62]:
#8 Address the duplicates using an appropriate method

Not Applicable

In [63]:
# Exporting df_ords_clean and df_prods_clean

In [83]:
df_ords = pd.read_csv(os.path.join(path, '/Users/mdiaz/Desktop/CF/Project 4 Instacart Python/Data/Org/Prepared Data 4.4/orders_wrangled.csv'), index_col = False)

In [81]:
df_prods = pd.read_csv(os.path.join(path, '/Users/mdiaz/Desktop/CF/Project 4 Instacart Python/Data/Org/Prepared Data 4.4/products.csv'))